[PushUpKineticEruptionLv1 X2AbilityTemplate]
LocFriendlyName="Kinetic Eruption"
LocLongDescription="Kinetic Eruption is an explosive blast of energy which can fling the foes away from the solider."

[PushUpKineticEruptionLv2 X2AbilityTemplate]
LocFriendlyName="Kinetic Eruption"
LocLongDescription="Kinetic Eruption is an explosive blast of energy which can fling the foes away from the solider."

[PushUpKineticEruptionLv3 X2AbilityTemplate]
LocFriendlyName="Kinetic Eruption"
LocLongDescription="Kinetic Eruption is an explosive blast of energy which can fling the foes away from the solider."

[PushUpKineticEruptionLv4 X2AbilityTemplate]
LocFriendlyName="Kinetic Eruption"
LocLongDescription="Kinetic Eruption is an explosive blast of energy which can fling the foes away from the solider."

[PushUpKineticEruptionLv5 X2AbilityTemplate]
LocFriendlyName="Kinetic Eruption"
LocLongDescription="Kinetic Eruption is an explosive blast of energy which can fling the foes away from the solider."

[PushUpKineticDetonationLv1 X2AbilityTemplate]
LocFriendlyName="Kinetic Detonation"
LocLongDescription="Detonation target's energy shileds to cause explosion."

[PushUpKineticDetonationLv2 X2AbilityTemplate]
LocFriendlyName="Kinetic Detonation"
LocLongDescription="Detonation target's energy shileds to cause explosion."

[PushUpKineticDetonationLv3 X2AbilityTemplate]
LocFriendlyName="Kinetic Detonation"
LocLongDescription="Detonation target's energy shileds to cause explosion."

[PushUpKineticDetonationLv4 X2AbilityTemplate]
LocFriendlyName="Kinetic Detonation"
LocLongDescription="Detonation target's energy shileds to cause explosion."

[PushUpKineticDetonationLv5 X2AbilityTemplate]
LocFriendlyName="Kinetic Detonation"
LocLongDescription="Detonation target's energy shileds to cause explosion."

[PushUpKineticProtectionFieldLv1 X2AbilityTemplate]
LocFriendlyName="Kinetic Protection Field"
LocLongDescription="Solider can grant an energy shield to all nearby allies."

[PushUpKineticProtectionFieldLv2 X2AbilityTemplate]
LocFriendlyName="Kinetic Protection Field"
LocLongDescription="Solider can grant an energy shield to all nearby allies."

[PushUpKineticProtectionFieldLv3 X2AbilityTemplate]
LocFriendlyName="Kinetic Protection Field"
LocLongDescription="Solider can grant an energy shield to all nearby allies."

[PushUpKineticProtectionFieldLv4 X2AbilityTemplate]
LocFriendlyName="Kinetic Protection Field"
LocLongDescription="Solider can grant an energy shield to all nearby allies."

[PushUpKineticProtectionFieldLv5 X2AbilityTemplate]
LocFriendlyName="Kinetic Protection Field"
LocLongDescription="Solider can grant an energy shield to all nearby allies."

[KineticContainmentFieldLv1 X2AbilityTemplate]
LocFriendlyName="Kinetic Containment Field"
LocLongDescription="Kinetic Containment Field allows you to imprison a foe in a sphere of Kinetic energy, absorbing incoming damages, and also preventing them from making a move."

[KineticContainmentFieldLv2 X2AbilityTemplate]
LocFriendlyName="Kinetic Containment Field"
LocLongDescription="Kinetic Containment Field allows you to imprison a foe in a sphere of Kinetic energy, absorbing incoming damages, and also preventing them from making a move."

[KineticContainmentFieldLv3 X2AbilityTemplate]
LocFriendlyName="Kinetic Containment Field"
LocLongDescription="Kinetic Containment Field allows you to imprison a foe in a sphere of Kinetic energy, absorbing incoming damages, and also preventing them from making a move."

[KineticContainmentFieldLv4 X2AbilityTemplate]
LocFriendlyName="Kinetic Containment Field"
LocLongDescription="Kinetic Containment Field allows you to imprison a foe in a sphere of Kinetic energy, absorbing incoming damages, and also preventing them from making a move."

[KineticContainmentFieldLv5 X2AbilityTemplate]
LocFriendlyName="Kinetic Containment Field"
LocLongDescription="Kinetic Containment Field allows you to imprison a foe in a sphere of Kinetic energy, absorbing incoming damages, and also preventing them from making a move."

[PushUpKineticLevitatedLv1 X2AbilityTemplate]
LocFriendlyName="Kinetic Levitated"
LocLongDescription="Lift up Target"

[PushUpKineticLevitatedLv2 X2AbilityTemplate]
LocFriendlyName="Kinetic Levitated"
LocLongDescription="Lift up Target"

[PushUpKineticLevitatedLv3 X2AbilityTemplate]
LocFriendlyName="Kinetic Levitated"
LocLongDescription="Lift up Target"

[PushUpKineticLevitatedLv4 X2AbilityTemplate]
LocFriendlyName="Kinetic Levitated"
LocLongDescription="Lift up Target"

[PushUpKineticLevitatedLv5 X2AbilityTemplate]
LocFriendlyName="Kinetic Levitated"
LocLongDescription="Lift up Target"

[PushUpKineticSnap X2AbilityTemplate]
LocFriendlyName="Kinetic Snap"
LocLongDescription="Solider can create a burst of Kinetic energy just behind the target, knocking them toward to the solider."
